this is my first code in 7-11 at dev branch

this is my second code at dev

modify at origin/dev

local update2
origin  update 1
714本地加内容
拜个早年
加点内容
忘了东西了，再加上
123456随便写点东西


723本地dev分支加东西
726改变之前的文件

725dev本地加东西测amend

726本地加了点东西

726远程加东西


726本地再加东西222222

726远程再加东西啊22222


726远程第三次加东西


726本地三次加东西


726远程第四次加东西


726本地第四次加东西   我远程修改了又
726远程第五次在41行加东西    11111111111远程修改之前的
111111111111并加了新东西


726本地第五次在42行加东西

726本地第五次在42行加东西  我本地又修改了一下哈哈
726本地修改之前的    -------------继续改之前的代码
还是想再次测试一下git pull rebase 和continue
